---
type: RegenerationAttribute
namespace: Autodesk.Revit.Attributes
version: 2024
members: 2
tags: [revit-api, class]
---

# RegenerationAttribute

`Autodesk.Revit.Attributes.RegenerationAttribute` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RegenerationAttribute | 2011 | `public RegenerationAttribute ( RegenerationOption option )` |
| Property | Option | 2011 | `public RegenerationOption Option { get ; }` |